<?php include("../shablony/verhushka.php"); ?>
<?php include("../shablony/styli.php"); ?>
<?php include("../shablony/shapka.php"); ?>

<h1>Моя Demio</h1>
О своей "Демке" я упоминал в <a href="/istorii/vechnost_vozvrashenia_v_irkutsk.php">"Вечности возвращения в Иркутск"</a>. Пробыла у меня она всего-навсего два месяца
и была моим первым авто. Демку я выбирал не один - тогда я и представить не мог себе, чтобы поехать и выбрать самостоятельно авто. Вообще, авто для
меня было чем-то запретным, недоступным. Я не мог себе позволить себе начать разбирать авто, что-то менять в ней. Вообщем, недотрожная вещь...<br/><br/>
И вот я прошу коллегу по работе, у неё муж интересовался mazda, и все машины у них были именно этой марки. Мы смотрим на авито, а потом едем с ними
выбирать авто. Сначала смотрим несколько вариантов в Иркутске, потом был Ангарск, и наконец находим подходящий вариант в Усолье-Сибирском.<br/><br/>
Это был вариант на механической коробке, руль есстесственно, как и у всех Demio (о другом я не слышал) правый. А, да, двигатель 1.5 или 1.3, если вспомню, то допишу. 
И она была бензиновая.<br/>

<?php include("../shablony/podval.php"); ?>