<?php include("shablony/verhushka.php"); ?>
<?php include("shablony/styli.php"); ?>
<?php include("shablony/shapka.php"); ?>

<h1>Байкал и Иркутск</h1>
Это история одного города и одного озера.<br/>
В этом разделе я рассказываю о своих родных краях, поездках, выкладываю фотографии и вообще делюсь.<br/><br/>
Несмотря на то, что сайт по большому счёту программисткий и преподавательский,
но я считаю, что этот раздел говорит не меньше обо мне, чем мой труд.
Здесь можно уведеть того "я", который рос, ассоциировался со своим городом, родной природой.<br/><br/>
И после того, как я <a href="vechnost_vozvrashenia_v_irkutsk.php">трижды уезжал в столицу</a>, чтобы трудиться там - несмотря на это я каждый раз возвращался.<br/><br/>
<h1>Добро пожаловать</h1>
Поэтому добро пожаловать! Теперь уже от всей души!<br/>
В этом разделе я не буду скрывать своих чувств и эмоций. А буду таким, каким я привык ощущать себя сам.<br/><br/>
И первая история - о моём городе. Поэтому <a href="/o_moem_gorode.php">скорей сюда</a>.

<?php include("shablony/podval.php"); ?>