<?php include("shablony/verhushka.php"); ?>
<?php include("shablony/styli.php"); ?>
<?php include("shablony/shapka.php"); ?>
<h1>Об авторе сайта</h1>
Всем добрый день! Меня зовут Илья Домышев и я из Иркутска. Иркутск город с более чем трёхсотлетней историей, о своём городе <a href="o_moem_gorode.php">я пишу здесь.</a><br/><br/>
То, чем я увлекаюсь - это программирование, медитация, философия, зарядка, уборка нашего города, мастерство.<br/> Обо всём этом - <a href="#">здесь</a>.<br/><br/>
Как вы поняли, мне есть чем заняться в жизни и я не скучаю.<br/><br/>
А вот несколько моих статей, тему выбирайте сами:<br/>
<a href="#">Почему я люблю программировать?</a><br/>
<a href="#">Какой опыт я получил в конструировании машин?</a><br/>
<a href="/istorii/vechnost_vozvrashenia_v_irkutsk.php">Почему я люблю Иркутск и почему я его выбираю? Почему я вернулся из Москвы?</a><br/>

<?php include("shablony/podval.php"); ?>
