<?php include("shablony/verhushka.php"); ?>
<?php include("shablony/styli.php"); ?>
<?php include("shablony/shapka.php"); ?>
<h1>Об авторе сайта</h1>
Всем добрый день! Меня зовут Илья Домышев и я из Иркутска. Иркутск город с более чем трёхсотлетней историей, о своём городе <a href="o_moem_gorode.php">я пишу здесь.</a><br/><br/>
То, чем я увлекаюсь - это программирование, медитация, философия, зарядка, уборка нашего города, мастерство.<br/> Обо всём этом - <a href="/moi_uvlechenia.php">здесь</a>.<br/><br/>
Как вы поняли - мне есть чем заняться в жизни, и я не скучаю.<br/><br/>
А вот несколько моих статей, тему выбирайте сами:<br/>
<a href="#">Почему я люблю программировать?</a><br/>
<a href="/oka/konstruirovanie.php">Какой опыт я получил в конструировании машин?</a><br/>
<a href="/istorii/vechnost_vozvrashenia_v_irkutsk.php">Почему я люблю Иркутск и почему я его выбираю? Почему я вернулся из Москвы?</a><br/>
<br/><h1>Раздел Ссылки</h1>
Я удивлён, но 20 апреля 2020 года на этом сайте появился раздел со ссылками. Но у него есть принцип - я указываю не то, куда ведёт ссылка. 
А то, чем именно мне были полезны материалы по данному адресу. Кто знает, чем они будут полезны вам?<br/><br/>
<a href="/ssylki.php">Перейти</a>

<br/><br/><h1>Помощник на сайте</h1>
4 апреля 2020 года - в этот прекрасный солнечный день, когда за окном поют птицы, на моём сайте появился помощник.<br/><br/>
Сначала он задумывался, как навигатор, но теперь я понимаю, что он может быть немного умнее.<br/>
Перемещаясь по страницам сайта он будет вам подсказывать, где вы находитесь и куда ещё можете перейти.

<br/><h1>Инструменты</h1>
1. Список цветов, которые я использую в <a href="/uroki_javascript/moia_palitra.php">моей палитре</a>
<div style="margin-top:6px;"></div>
2. <a href="/uroki_javascript/risovalka_pramougolnikov.php">Рисовалка прямоугольников</a>, которую я сделал для учебных целей.
<div style="margin-top:6px;"></div>
3. Рисовалка схем на <a href="/instrumenty/risovalka-schem.php">этой странице</a>
<div style="margin-top:6px;"></div>
4. <a href="/instrumenty/sravnenie_stran.php">Сравнение стран</a> по населению и площадям

<?php include("shablony/podval.php"); ?>
