<?php include("shablony/verhushka.php"); ?>
<?php include("shablony/styli.php"); ?>
<?php include("shablony/shapka.php"); ?>

<h1>Да, пожалуй в Иркутске не жарко. Но что это значит для меня?</h1>
Итак, я из Иркутска. И что это значит? Да, здесь холодно. Иркутск относят к Сибири. Но стоп! Я привык думать не о том, что это значит вообщем, а что же это значит для меня?<br/><br/>
А для меня - это возможность видеть снег, причём красивый белый снег начиная с ноября и вплоть до мая! Да, в Иркутске снег лежит - ноябрь, декабрь, январь, февраль, март, апрель! 
Итого шесть месяцев.
<h1>Сколько лет я прожил в Иркутске?</h1>
Иркутск - город надежд. Так считаю я. И часть из этих надежд оправдались - например, люди приезжали сюда, так как эта ЗЕМЛЯ была богата золотом, красным деревом (лиственицей),
другими ископаемыми. Но я тех времён не застал...<br/><br/>
И всё же для многих моих современников Иркутск стал городом надежд. Кто-то приезжал сюда к своим любимым, и приезжает и ныне (пишу я этот текст в 2020 году, отталкивайтесь от этого). 
Для кого-то Иркутск стал и отправной точкой для переезда в более крупные мегаполисы, например, Красноярск. Таких я тоже знаю.<br/><br/>
Я же расскажу про свою надежду. А моей надеждой (Тётя Надя - не ругай меня) стала возможность вернуться в Иркутск спустя три года жизни в Москве.
Эти три нелёгких года сейчас мне кажутся целой вечностью - почему, я <a href="/istorii/vechnost_vozvrashenia_v_irkutsk.php">рассказываю здесь</a>.<br/><br/>
Но в Москве я прожил не только три года, а ещё год, а потом ещё год. Итак, я возвращался - потому что я не знал, что выбрать. Потом я уезжал. Потом снова возвращался.<br/>
И потом вернулся, и больше не уезжал.<br/><br/>
Получается, я уезжал трижды из Иркутска в Москву - и трижды я вернулся.<br/><br/>
Интересный для меня вопрос - и я его до сих пор не раскрыл полностью - "Почему же я возвращался? Что меня тяготило в Москве, но от чего я отказывался, и выбирал снова Иркутск?".<br/><br/>
Сейчас я нахожусь в Иркутске уже более года с того момента, как вернулся из Москвы в последний раз. И уезжать больше не планирую. Хотя я любитель путешествовать и с удовольствием 
бы куда-нибудь слетал. Но сейчас КОРОНОВИРУС в разгаре и вряд ли имеет смысл куда-либо ехать. Однако, посмотрим, что будет ближе к осени...
<h1>Вопрос не раскрыт - но я не сдаюсь?</h1> 
Тот вопрос, что я задал в прошлом заголовке до сих пор не раскрыт! А я, кажется, уже устал писать... Пальцы затекают. Я пытался пилить листок фанеры, но пила не подходящая.<br/>
Я сидел на диване и спина затекла. Но вопрос не раскрыт!<br/><br/>
А всё дело в том, что чем больше я углубляюсь в раскрытие этого вопроса, тем больше я завязаю в липком болоте воспоминаний, непрожитого прошлого и излишних подробностей.<br/><br/>
Но что, если это мой путь и подругому я двигаться не умею? Что если мне нужно пройти через болото, чтобы выйти на поляну ясности и успокоения?<br/><br/>
По всей видимости это мой путь и я продолжаю...<br/><br/>
Москва


<?php include("shablony/podval.php"); ?>