<?php include("shablony/verhushka.php"); ?>
<?php include("shablony/styli.php"); ?>
<?php include("shablony/shapka.php"); ?>

<h1>Да, пожалуй в Иркутске не жарко. Но что это значит для меня?</h1>
Итак, я из Иркутска. И что это значит? Да, здесь холодно. Иркутск относят к Сибири. Но стоп! Я привык думать не о том, что это значит вообщем, а что же это значит для меня?<br/><br/>
А для меня - это возможность видеть снег, причём красивый белый снег начиная с ноября и вплоть до мая! Да, в Иркутске снег лежит - ноябрь, декабрь, январь, февраль, март, апрель! 
Итого шесть месяцев.
<h1>Сколько лет я прожил в Иркутске?</h1>
Иркутск - город надежд. Так считаю я. И часть из этих надежд оправдались - например, люди приезжали сюда, так как эта ЗЕМЛЯ была богата золотом, красным деревом (лиственицей),
другими ископаемыми. Но я тех времён не застал...<br/><br/>
И всё же для многих моих современников Иркутск стал городом надежд. Кто-то приезжал сюда к своим любимым, и приезжает и ныне (пишу я этот текст в 2020 году, отталкивайтесь от этого). 
Для кого-то Иркутск стал и отправной точкой для переезда в более крупные мегаполисы, например, Красноярск. Таких я тоже знаю.<br/><br/>
Я же расскажу про свою надежду. А моей надеждой (Тётя Надя - не ругай меня) стала возможность вернуться в Иркутск спустя три года жизни в Москве. Эти три нелёгких года сейчас мне кажутся целой вечностью - почему, я <a href="vechnost_vozvrashenia_v_irkutsk.php">рассказываю здесь</a>.


<?php include("shablony/podval.php"); ?>