<?php include("shablony/verhushka.php"); ?>
<?php include("shablony/styli.php"); ?>
<?php include("shablony/shapka.php"); ?>

<h1>Моё портфолио</h1>

Ниже приведены те организации, с которыми я сотрудничал, а также предмет сотрудничества.<br/>
В двух профобластях - программирование и системное администрирование.<br/>
И в двух городах: Москва (центр технологий) и Иркутск (мой родной город).<br/><br/>


<b>Группа компаний "Акустик Групп"</b> (<a href="https://www.acoustic.ru/">www.acoustic.ru</a>), г.Москва<div style="height:7px;"></div>
Настройка и поддержка физических и виртуальных серверов Windows Server/Debian Linux. Настройка системы резервного копирования Windows Server Backup, Acronis, Veeam Backup для виртуальных машин.
Настройка и модернизация АТС Panasonic TDA-100, NSP/NCP 500, подключение линий IP и аналоговых от провайдера. Программирование внутрикорпоративного портала на языках HTML, CSS, Javascript, PHP, SQL. 
Создание, настройка виртуальных машин Hyper-V и VMWare. Настройка печатающего оборудования A4/A3. Настройка блоков бесперебойного питания. Обустройство серверных комнат.
Прокладка ЛВС, обустройство серверных шкафов. Настройка веб-трансляций Webinar.ru. 
Настройка планшетов и смартфонов Apple iPad, iPhone, Windows Phone, Android. Настройка ПК в варианте desktop и laptop. Устройство системы учёта компьютерной техники и программного обеспечения. 
Настройка служб DNS, DHCP, Samba, Active Directory. Настройка фаервола Kerio Control. Проект по переводу почты с Postfix на Exchange. Настройка сервера 1С. Настройка  серверов баз данных MSSQL, MySQL.
<br/><br/>

<b>Ваш Интернет Сервис</b> (<a href="http://1ps.ru">1ps.ru</a>), г.Иркутск<div style="height:7px;"></div>
Настройка ПК, серверов на базе Windows и Linux, АТС Panasonic TES-824, антивируса касперского с централизованным управлением, Microsoft Active Directory, прав на папки, роутера, установка Windows и Linux,
настройка резервного копирования Acronis, Windows Server Backup. Вёрстка сайта. Администрирование системы регистрации сайтов в интернет-каталогах.

<br/><br/>

<b>Компания "Инсайт"</b> (<a href="https://www.in-site.ru/">in-site.ru</a>), г.Иркутск<div style="height:7px;"></div>
Создание сайтов - вёрстка HTML/CSS, программирование на JavaScript, PHP.<br/><br/>
 
<b>Иркутский лимнологический институт, Лаборатория геносистематики</b>, (<a href="http://www.lin.irk.ru/">www.lin.irk.ru</a>), г.Иркутск<div style="height:7px;"></div>
Программирование системы расчётов по моделям видообразования. Системное администрирование.<br/><br/>

<b>Медиалогия</b> (<a href="http://mlg.ru">mlg.ru</a>), г.Москва<div style="height:7px;"></div>

Системное администрирование сервиса по сбору новостей в интернет. Системы написаны на C#/Powershell. Также вносил правки в исходный код через Visual Studio и скрипты.<br/>
Выполнял deploy по средствам TFS, при этом поддерживал NLB - переключение клиентов между веб-серверами в процессе обновления. Отслеживал функционирование системы через Zabbix. 
Также столкнулся с обслуживанием Sphinx. <br/>Писал запросы на языке T-SQL. Системы Windows Server, MSSQL.
<br/><br/>


<b>ФГУП "Атлас"</b> (<a href="http://stcnet.ru/">stcnet.ru</a>), г.Иркутск<div style="height:7px;"></div>
Настройка и обслуживание комплексов учёта алкогольной продукции на базе компьютеров PC, баз данных MSSQL, средствами защиты. Консультирование клиентов в области использования услуг компании.

<b>Окей/Цезарь</b>, г.Иркутск<br/>
Прокладка ЛВС, настройка касс, торгового оборудования, принтеров, компьютерной техники.

<br/><br/>

<b>ADG Group</b> (<a href="https://www.adggroup.ru/">www.adggroup.ru</a>), г.Москва<div style="height:7px;"></div>
Экспертиза в разделе закупки оборудования и программного обеспечения, лицензирования ПО.<br/>
<br/>Проектирование устройства серверной инфраструктуры. Консультирование в области создания ИТ-бюджета компании с учётом специфики - определение стоимости нормомест и норм ПО.<br/>
<br/>Администрирование систем контроля доступа, серверной, в том числе виртуальной инфаструктуры. Управление почтовым сервером Exchange и телефонией Манго-Телеком.<br/>
<br/>Консультирование подрядчиков в разделе технического обеспечения и составление требований для открытия доп. офиса, установки систем видеонаблюдения.<br/>
<br/>Экспертиза в разделе выбора техники для организации мест труда для сотрудников.
<br/><br/>

<b>Softline</b> (<a href="http://softline.ru">softline.ru</a>), г.Иркутск<div style="height:7px;"></div>
Техническая экспертиза решений по программному обеспечению и серверному/инженерному оборудованию.<br/>
Помощь в презентации клиентам компании.
<br/><br/>

<b>Городская клиническая больница №6</b>, г.Иркутск<div style="height:7px;"></div>
Поддержка и настройка компьютеров и локальной сети. Экспертиза.
<br/><br/>

<b>Проект 24</b>, г.Москва<div style="height:7px;"></div>
Поддержка нескольких серверов, в т.ч. телефония PBX. Поддержка клиентских машин.<br/>
Windows Server, PBX (Asterix), Microsoft Windows 7, TeamViewer.
<br/><br/>



<?php include("shablony/podval.php"); ?>

