<?php include("shablony/verhushka.php"); ?>
<?php include("shablony/styli.php"); ?>
<?php include("shablony/shapka.php"); ?>

<h1>Вечность возвращения в Иркутск</h1>
История берёт своё начало в далёком 2012 году (когда я пишу эту статью, то на дворе 2020-й). Именно тогда я купил машину - да, свою первую Mazda Demio.<br/><br/>
Про свою Demio я <a href="moya_pervaya_mashina_mazda_demio.php">написал здесь</a>.<br/><br/> Скажу лишь одно - машиной я насладиться не успел, 
водить я боялся и в итоге машина пробыла у меня всего два месяца. Но боялся я не только водить, а ещё и поломок машины - тогда мне казалось,
что поломка машины - это что-то ужасное.<br/>И так как я совсем не разбирался в устройстве машин, то мне казалось, что сломаться должно всё и сразу.<br/><br/>
Но вообщем-то продал я её не потому что боялся, а потому что почувствовав в себе силы, которые меня вообщем то окрылили, я решил пойти дальше и "рвануть" 
из своего маленького, как мне тогда казалось - ограниченного Иркутска в столицу.<br/><br/>Позже я понял - ох как больно мне было, что единственным, 
кто был ограниченным - это был я сам. Но я был не только ограниченностью - ещё я был тщеславным, гордым, напыщенным, да ещё как оказалось любил приврать.<br/>
<br/>Особенно меня забавляло враньё самому себе - но похоже оно так глубоко вросло в меня, что я отчаяно не понимал или отказывался принять, что я врун со стажем.
<h1>Хватит о себе! Так что же случилось дальше, когда я поехал в Москву?</h1>
Москва меня ждала, а я ждал её. Спустя год жизни в Москве я смог бы так сказать. И я так действительно полагал.<br/><br/>
Сам переезд оказался достаточно трудным. Во-первых я продавал машину, во-вторых уходил из фирмы, где я успешно трудился в течение последних трёх лет.<br/>
<br/>По сути эта фирма - <a href="http://1ps.ru">1PS.RU</a> стала для меня действительно чем-то особенным. Ещё в институте, на мат. факе я начал свою профессиональную деятельность 
в роли системного администратора - в должности было написано "программист", но вообщем-то у нас - это весьма распространено называть программистами системных администраторов,
ведь для людей, не особенно углубляющихся в тонкости устройства компьютерных систем зачастую это одно и то же.
<br/><br/>Тогда вот таким сисадмином я стал при Городской Клинической Больнице №6
на улице Якоби. Больница эта располагается в прекрасном месте - на берегу залива Ангары. Об этом моём месте труда <a href="ya_truzhus_dlya_bolnicy_na_yakobi.php">читайте здесь</a>.<br/><br/>
Потом после больницы было ещё четыре места, где я трудился. Больница пришлась на второй курс Университета. Далее я совмещал в Лимнологическом Институте.
Далее в фирме Атлас, далее в небольшой конторе, которая занималась созданием сайтов - Инсайт. И в сети гипермаркетов ОКей и Цезарь, базировались мы тогда в ТЦ Авалон.<br/><br/>
И вот только позже - дайте ка посчитаю - я уже перечислил 5 фирм. То есть к окончанию университета у меня уже был опыт сотрудничества с четырьмя фирмами
а к моменту устройства в ВИНС (1ps.ru) уже помог 5 фирмам.<br/><br/>
Ну и скорость - аж дух захватывает! А я то думаю, что меня так переполняет, что я хочу писать и делиться!<br/>
Получается, что я в то время ехал без остановки на пятой и иногда даже переключался на шестую!<br/>
Вот, что значит родные преподаватели в школе и университете зарядили - ехать и ехать потом!<br/><br/>
в была всем, что у меня было в плане положительного опыта после института.<br/>
Да, на момент, когда

<?php include("shablony/podval.php"); ?>