<?php include("../shablony/verhushka.php"); ?>
<?php include("../shablony/styli.php"); ?>
<?php include("../shablony/shapka.php"); ?>

<h1>Уроки для мастера JavaScript</h1>

Я надеюсь, что те материалы, которые я здесь выкладываю, а материалы все созданы мной собственноручно - будут полезны и вам.<br/><br/>
Почему "и"? Да потому что мне они полезны - когда я пишу что-то, то в первую очередь я ориентируюсь на себя.<br/>
В самом деле, как можно узнать другого если не узнать себя?<br/><br/> С другой стороны лучшего всего мы знаем именно себя.
И если я получаю от этого пользу, то, возможно, и другие получат.

<h1>Структура уроков</h1>

Создавая структуру, я хочу опираться на цвета. Цвета - это то, что мы видим. Проснувшись с утра мы видим, что небо серое - тогда наше настроение ухудшается (не всегда).
Если же небо ярко-голубое, то мы понимаем, что у нас всё хорошо. Так мы живём.<br/><br/>
Так как же JavaScript связан с цветами? Хорошая новость - он может ими управлять и очень гибко.<br/><br/>
Когда я программирую, то для меня очень важно, чтобы то, что я создаю было выразительным и понятным для других.<br/><br/>
<a href="#">Вот мой первый проект</a>, в котором я использовал JavaScript для создания интерактивной таблички учёта времени, оплачиваемого сотрудникам.
В этом проекте я набрался смелости и решил пойти не тем путём, который я возможно уже видел ранее. А тем, что было максимально удобно именно для данного запроса или потребности.<br/><br/>
Я предлагаю и вам поступать также - иногда храбрость намного важнее многих идей и умных объяснений. О моём подходе и философии - <a href="#">здесь</a>.

<h1>Итак, а где же сами уроки?</h1>
Если ты дочитал до этого места, то я тебя поздравляю! Значит ты прошёл первое испытание и теперь тебе открывается что-то неузнанное, новое и сложное. Но сложное - это не плохо,
а наборот хорошо. Так ты сможешь узнать лучше себя и окружающий мир.<br/><br/>
Как я уже сказал, так как ты был терпелив, то получаешь награду - уроки. Уроки здесь не пронумерованы - я постарался их сделать так, чтобы можно было начать с любого 
и переходить к другим в том порядке, в котором тебе кажется будет более логичным и понятным.<br/><br/>

<h1>Сначала знакомимся с цветами...</h1>

Как я уже говорил, изучение JavaScript я хочу начать с цветов. В этом уроке я буду создавать рисунок с помощью JavaScript.<br/><br/>
На рисунке будут фигуры - разных цветов. Отличие рисунка в построении от ручного создания - тем, что фигуры будут распологаться по определённому алгоритму, который 
я и пропишу с помощью скрипта.<br/><br/>
Чтобы начать переходи сюда - урок <a href="urok_snachala_cveta.php">"Сначала цвета"</a>

<?php include("../shablony/podval.php"); ?>