<?php include("../shablony/verhushka.php"); ?>
<?php include("../shablony/styli.php"); ?>
<?php include("../shablony/shapka.php"); ?>

<h1>Урок "Сначала цвета"</h1>

Итак, как я и обещал, в этом уроке я буду создавать набор фигур разных цветов. Фигуры будут расположены на "фанерке" по определённому алгоритму. 
Алгоритм этот будет задан с помощью скрипта JavaScript.<br/><br/>
Прежде, чем начать я хочу немного рассказать о том, что я думаю о цветах. Например, для меня в детстве существовали в основном красный, синий, зелёный и другие такие же яркие цвета.<br/><br/>
Наверное, первое их преимущество в том, что они называются очень просто. Но есть ещё одно более важное их преимущество - если такие цвета смешать, то получится много других 
цветов. Можно представить себе, что мы берём краски - на самом деле так и есть - и смешиваем их. В результате получаются новые цвета!<br/><br/>
Цвета, которые мы смешиваем я назову родительскими цветами - это как бы цвета-родители. И они "рожают" своих детей - это цвета, полученные в результате смешения цветов-родителей.<br/><br/>
А те цвета, которые получаются в результате смешения пусть будут "детскими цветами". Детские цвета бывают менее яркими, но не всегда.

<h1>Несколько "взрослых" цветов</h1>

Я начну со "взрослых" цветов - это красный, зелёный, синий. Их всего три! Это самые старые и самые мудрые цвета! 
Почему? Да потому что от них появились все другие цвета! 
Но это только в одной из версий... Об остальных ты можешь <a href="#">узнать здесь</a>.<br/><br/>
Вот эти три мудрых цвета (красный, зелёный и синий):<br/>
<div style="padding-top:15px;">
	<div style="width:50px;height:50px;background:#f00;float:left;margin-right:10px;"></div>
	<div style="width:50px;height:50px;background:#0f0;float:left;margin-right:10px;"></div>
	<div style="width:50px;height:50px;background:#00f;float:left;margin-right:10px;"></div>
	<div style="clear:both;"></div>
</div>
<br/>
Это прекрасные цвета и я их очень люблю. Но есть и то, что мне в них не очень нравится. Это то, что они не настоящие. Я никогда не видел на улице такого красного цвета,
такого зелёного и такого ярко-синего. Да, ты можешь меня остановить и сказать - "я видел такое на рекламном плакате, когда выходил из дома". Но я говорю сейчас не о рекламных щитах,
а о цветах матушки-природы. Так вот у нас в Росиии я таких цветов в природе не видел (хотя в джунглях они, конечно, есть).<br/><br/>
Поэтому я попробую сейчас сделать и другие цвета, может быть всё ещё такие же яркие, но уже более похожие на те, что я видел, когда рос. А вырос я <a href="/o_moem_gorode.php"> в Иркутске</a>.
Но как я могу получить другие "новые" цвета? <br/><br/>Самое простое, что придумал человек - это смешивать имеющиеся цвета, то что ты возможно делал на уроках рисования в школе в детстве
или делаешь и по сей день, если ты художник. Конечно, экран твоего смартфона или компьютера сильно отличается и "лампочки"-светодиоды в силу своих физических свойств могут сразу светиться
желаемым цветом, в зависимости от того, насколько высокое электрическое напряжение на них подаётся.<br/><br/>То есть по сути нам не надо ничего смешивать, чтобы компьютер вывел на экран
нужный цвет? Да, это так... Смешение цветов используется только для человека, чтобы нам было понятнее, как образуются цвета - чтобы сохранить возможность мыслить на уровне оттенков.
То есть когда мы говорим - больше красного или больше зелёного и таким образом меняем цвет. Компьютеру в этом смысле всё равно.

<h1>И опять я затянул...</h1>
Да, уж, есть у меня такая привычка - изъясняться очень долго. Хочется "зацепить" все детали, разобраться, как устроены те предметы, о которых я говорю. Закончил я на
том, как мы (люди) привыкли образовывать цвета и том, что компьютер делает это совсем другим способом. Но и то и другое обусловлено лишь историей, и тем, как устроены мы (люди) и компьютер.
Сейчас же я продолжу объяснять с точки зрения восприятия красок человеком. А для этого получу все возможные результаты смешения представленных выше "мудрых" цветов - красного, зелёного,
и синего.<br/><br/>
Результаты смешения слева направо - красный и зелёный, красный и синий, зелёный и синий.
<div style="padding-top:15px;">
	<div style="width:50px;height:50px;background:#ff0;float:left;margin-right:10px;"></div>
	<div style="width:50px;height:50px;background:#f0f;float:left;margin-right:10px;"></div>
	<div style="width:50px;height:50px;background:#0ff;float:left;margin-right:10px;"></div>
	<div style="clear:both;"></div>
</div>
<br/>Получилось ещё три уже "детских" цвета - жёлтый, сиреневый (пурпурный) и бирюзовый. Но и этих цветов мало, чтобы насладиться тем, что есть вокруг нас.
Кстати, даже когда не было компьютеров - мы уже могли видеть всё многообразие цветов в окружающем мире. И компьютер лишь повторил это. Как я говорил,
в России, где я вырос природа содержит не весь набор возможных цветов. У нас цвета более "пастельные" - цвет берёзы, "жёлтая" осень, рожь, земля.
В других странах, где есть джунгли можно встретить животных с очень яркой раскраской. Можно сказать, что каждое место на Земле дополняет набор наших
цветов.

<h1>Продолжим смешивать во всех вариантах?</h1>
Наверное, можно бы было теперь смешать между собой желтый, пурпурный и бирюзовый. А потом ещё смешать те цвета, которые получились в результате. 
И сказать, что мол вот столько то цветов рождается из такого-то количества цветов и есть столько-то промежуточных цветов!<br/><br/>
Но стоп! Я хоть и математик, и программист, но я люблю красоту! И математика тут не при чём! Вопрос красоты он вне счёта, вне математических операций!
Красиво, просто потому что красиво! И я обожаю то, что это возможно! Поэтому сейчас я представлю те цвета, которые я люблю. В их формировании тоже есть определённых алгоритм.
Но здесь я выбираю то, что мне нравится. А потом уже опираюсь на алгоритмы. А не наоборот!<br/><br/>
Я очень люблю такие цвета:
<div style="padding-top:15px;">
	<div style="width:50px;height:50px;background:#b00;float:left;margin-right:10px;"></div>
	<div style="width:50px;height:50px;background:#0b0;float:left;margin-right:10px;"></div>
	<div style="width:50px;height:50px;background:#00b;float:left;margin-right:10px;"></div>
	<div style="width:50px;height:50px;background:#600;float:left;margin-right:10px;"></div>
	<div style="width:50px;height:50px;background:#060;float:left;margin-right:10px;"></div>
	<div style="width:50px;height:50px;background:#006;float:left;margin-right:10px;"></div>
	<div style="width:50px;height:50px;background:#300;float:left;margin-right:10px;"></div>
	<div style="width:50px;height:50px;background:#030;float:left;margin-right:10px;"></div>
	<div style="width:50px;height:50px;background:#003;float:left;margin-right:10px;"></div>
	<div style="clear:both;"></div>
</div>
<br/>
В самом деле, если вспомнить детство, то в 90х у нас были разные карандаши. И были такие "советские" наборы карандашей, в которых были только яркие цвета - красный, зелёный, синий, голубой, оранжевый, жёлтый, чёрный, фиолетовый.
Но хотелось чего-то большего и когда в 90х появились инмортные наборы карандашей, то они как раз содержали такие "промежуточные" оттенки. Вот прямо, как эти девять квадратов выше. Помните?<br/><br/>
Мне кажется с тех пор я полюбил такие вот цветовые оттенки.

<?php include("../shablony/podval.php"); ?>