<?php include("../shablony/verhushka.php"); ?>
<?php include("../shablony/styli.php"); ?>
<?php include("../shablony/shapka.php"); ?>

Вы находитесь на странице "Конструирование машин"<br/>

<h1>Конструирование в моём детстве</h1>
Для меня эта тема началась относительно давно - в детстве, на даче. Тогда я наблюдал за разными приборами,
которыми занимался мой дед. То были сварочный аппарат, дрель, рубанок - много всего.<br/><br/>
Мне это нравилось и я тоже кое-что делал!<br/><br/>Например, собирал разные болты, гайки - скручивал их. Как-то даже сделал газонокосилку своими руками - деревянная рама,
листок ДВП снизу и нож, вращающийся на валу от стиральной машины. Руль от детского велосипеда трёхколёсного и от него же колёса. Косила машина за счёт электричества,
которое подавалось по проводу.<br/><br/>
А ещё мы с парнями ремонтировали и изменяли внешний вид своих велосипедов. Это было здорово!<br/> Был у нас такой буги-баги. Мы нашли раму от мопеда или мотоцикла.
Поставили на неё колёса от велосипеда и так вот катались, отталкиваясь ногами! Потом мой папа даже приварил нам сзади ось поперечную и "буги-баги" стал трёхколёсный.
Помню мы для взрослых сделали объявление и пытались его продать кому-нибудь. Это было замечательно!<br/><br/>
Помню ещё ребёнком около 4 лет я помогал маме на кухне и у неё сломалась чеснокодавка (выкрутился болт). Я взял похожий болт от железного конструктора (наверное, у многих
такие были) и починил. У меня даже не было идеи, сложно это или просто! Мне казалось это очевидным!<br/><br/>
<h1>Электрический ток</h1>
Потом в возрасте 5 лет (примерно) я возился с проводами, и решил собрать штекер для электрической сети. Я соединил два штырька вилки вместе и вставил в розетку! Меня тогда хорошо
тряхонуло, и я подумал, что меня бьёт мама, которая тогда была в коридоре, я же находился в комнате. Только позже мне объяснили, что это был электрический ток.
<h1>Опыт с машинами</h1>
Первая машина у меня появилась весной 2012 года. И это была Mazda Demio на литье, с люком, праворульная механика 1.3 литра серого цвета.<br/>
Пробыла она у меня недолго, около двух месяцев...<br/>Потом ещё были Pagero IO, отцовская шестёрка, Mark II 1989 года выпуска ярко-синего цвета.<br/>
И пожалуй всё...<br/>И первая машина, в которой я сам что-то ремонтировал был Марк II.
<h1>Ока</h1>
Жизнь складывается по-разному. Теперь у меня ОКА и я радуюсь ей. Это ВАЗ 11113 2003 года - досталась она мне в октябре 2019 года, пробег 30000 с копейками. Третий хозяин.<br/>
<br/>Всё говорило о том, что пробег реальный - ни гнили на кузове, в салоне аккуратно. Недавно моё предположение подтвердилось, когда я был в шиномонтажке - шины родные с завода.<br/>
<br/>
И вот передо мной встали интересные задачи - от замены замка зажигания. А его я переделал на кнопку и на данный момент электрика с замка снята, но оставил я его для замыкания руля.
Также завод сделал с кнопки. Потом менял стартер - по воле случая предыдущий был испорчен (не мной). Потом разбирался с поврёждённой электрикой. Снимал панель...<br/>
<br/>Всё это пришлось делать, после того, как мальчишки по 17 лет угоняли машину. Полиция их нашла, ущёрб возместили - а я вот занялся восстановлением.<br/>
<br/>Также сам вставлял стёкла (4 из 6и) - благо мне девушка моя помогла, технология конечно очень интересная.<br/><br/>
Родное правое зеркало (со стороны пассажира) не встаёт в заводской комплектации - это описывают в интернете, не знаю, у всех ли так, но у меня так было.<br/>
<br/>Купив комплект евро-зеркал я сильно удивился, потому что правое зеркало также не удалось отрегулировать - регулировка даже в крайнем положении показывает водителю область,
слишком далеко от машины, как будто сделано так, чтобы пассажир в это зеркало смотрел.<br/>
<br/>И когда мне разбили евро-зеркала угонщики, то я воспользовался случаем и
старые родные зеркала (впрочем, одно оказывается было не родное, похоже - у родных больше железных элементов), а именно правое - разобрал, снял фиксатор, который используется 
для складывания зеркала и жидкими гвоздями зафиксировал его в нужном положении. Нужно было, чтобы прошло три дня, чтобы жидкие гвозди хорошо затвердели - и наконец, зеркало встало, как надо.
<h1>Электические схемы ОКИ</h1>
Итак, как я сказал выше - я столкнулся с элетрикой в ОКЕ. Я поочёрёдно планирую разбирать здесь на своём сайте эти схемы по мере возможности. 
Я пробовал создавать схемы в Гугл-Таблицах. Пробовал их верстать. Но в итоге остановился на Inkscape - свободном векторном редакторе.  <br/>
<br/>
Вот список созданных мной схем и описаний к ним:<br/><br/>
<a href="/oka/schema_fishka_fary_i_povorotniki.php">Разъём "мама" на 8 контактов для подрулевых переключателей поворотов и фар (ВАЗ 1111 "ОКА")</a><br/><br/>
<a href="/oka/schema_fishka_perednij_dvornik.php">Разъём на 6 контактов подрулевого переключателя переднего стеклоочистителя (ВАЗ 1111 "ОКА")</a><br/><br/>

<?php include("../shablony/podval.php"); ?>