Наверное, некоторые из вас задавались вопросом - а почему моя жизнь протекает вот так, а не иначе?<br/>
При этом психологи не помогают, вообщем-то ничего не помогает...<br/>
Не помогают и школьные установки - по типу, что кто будет трудиться больше, тот будет и получать больше.<br/>
Наверное, кто-то задумывался, а почему раскрученный ПОП-музыкант (например, Мик Джаггер) - успешнее рядового музыканта,
который трудится не покладая рук. Мик Джаггер, кстати тоже трудился не покладая рук.<br/>
Я не даром привожу здесь пример Джаггера, потому что я начал читать книгу о Роллинг Стоунз, и был поражён количеством
наркотиков и проблем, которые были у ребят. И, несмотря, на это ему (Мику) удалось вырваться.<br/>
Но вырваться куда и откуда - об этом чуть позже...<br/><br/>
А сейчас я бы хотел вернуться, от чего начал - то есть почему Джаггер успешнее такого же "Джаггера", но из Москвы, или пусть Лондона - но "обычного" Джаггера.<br/>
Если вы ждёте сейчас простого ответа, то его не будет - хочу вас разочаровать. Я не коучер (благо) и не тот, кто раскрывает секреты успешности (а они есть?).<br/>
И финалом моей книги (истории) будет вопрос, на который отвечать придётся вам. За вас я вашу работу не сделаю?<br/><br/>
Что, вы ещё здесь - значит вы действительно упорный (здесь я подразумеваю что вы можете быть любого пола) и ещё и, возможно, вдумчивый...<br/><br/>
Но проверим это... Итак, Джаггер и "Джаггер2" или успешный Джаггер и простой Джаггер - пусть будет так. В чём же различие?<br/>
Я давно хотел ответить себе на этот вопрос - и задался им ещё лет в 13 (а вы?). Так вот, я считаю, что начинается всё с этого вопроса - любая успешность?<br/>
Если вы его себе не задаёте, то успешности просто не будет. Меня удивил ответ одного учителя философии и медитации (впрочем это русская женщина - буддолог),<br/>
и я спросил её - вот Буддизм говорит о Карме. Какая Карма у Мика Джаггера, простите - если он наркотики всю молодость употреблял.<br/>
И её ответ был такой - "ум король". То есть всё-таки, и я был обрадован, Буддизм говорит не о карме, а объясняет кармой происходящее. А говорит об уме.<br/>
И меня это поразило, и как я уже сказал, очень обрадовало. Я вообще не верю в судьбу. То есть она, конечно есть (а чем она не карма?).<br/>
Но верить я в неё не хочу - да просто потому, что если в неё верить, то я не могу ни на что повлиять? И как же это так?<br/>
Вопрос подхода - здесь я буду говорить о том, как можно повлиять на свою жизнь!<br/><br/>
Я не буду говорить, что она изменится - я даже не знаю, в каком состоянии сейчас ваша жизнь. Возможно, что всё настолько плохо, что уже ничего поменять не получится - честно,
я именно так думаю про свою жизнь. Но всё же, если попробовать, то можно чего-то добиться - например, если вы ещё живы и можете продолжить чтение, то у вас появляется шанс.<br/>
И шанс много больший, чем если бы в процессе чтения вы потеряли способность читать. Наверное, это грустно - тот, пример, который я привёл. Но к сожалению, если 
я не ошибаюсь, неприятные ситуации приходят не тогда, когда мы их ждём, а тогда, когда мы их совсем не ждём.<br/><br/>
Так вот Джаггер - король. А простой Джаггер - нет. И что сделать простому Джаггеру, чтобы тоже стать королём?<br/>
Внешне всё будет выглядеть одинаково - вот увидите. Сейчас проследим предполагаемую историю роста и формирования короля Джаггера и простого Джаггера.<br/>
Я искренне считаю, что это один и тот же человек. Но вот только этот один и тот же человек, делал разные выборы в разных жизненных ситуацияц.<br/>
Что, скажете - нет. Не всё и всегда зависит от человека? Это так, мир условий, в котором мы живём огромен, и у каждого из нас множество условий,
с которыми нам приходится соглашаться или нет. Но Джаггеру-королю тоже было нелегко, он же был наркоманом. Согласны?<br/><br/>
Тогда двигаемся на следующую, уже третью ступеньку на нашей лестнице. Кстати выходом из подвала (пусть это будет подвал для примера) будет поляна со свежим воздухом.
Когда мы поднимемся по лестнице, то увидим свет.<br/><br/>
На самом деле этот пример с лестницей и светом я взял из тренинга личностного роста, как их называют одной компании из Москвы. Они проводили такую медитацию,
в которой ты сначала представляешь себя в давящих оковах, а потом сбрасываешь их и выбираешься на свет. На свету становится легко и приятно, и ты
как бы освобождаешься.<br/>К чему я это..?<br/><br/>
Я говорил про лестницу - ах да, здесь для нас эта самая лестница и выход на свет из тёмного подвала будет означать такое освобождение от пластов обмана,
когда мы поймём, что жизнь Джаггера-короля (только для примера) могла легко превратиться в жизнь Джаггера-простока. И это зависело во-многом от Джаггера.
И что Джаггер-король сделал много усилий, чтобы она такой не стала. Но вот Джаггеру-простоку нелегко бы было стать королём.<br/><br/>
Итак, поехали. Какие трудности подстерегали того и другого на третьем шаге? Да, Джаггеры будут идти по этой лестнице вместе с нами!<br/>
