<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/verhushka.php"); ?>
<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/styli.php"); ?>
<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/shapka.php"); ?>

<h1>Наши проекты. <span style="color:#666;font-size:14pt;">Системное администрирование</span>.</h1>

Работы выполнялись в следующих проф областях:<br/>
<div style="height:4px;"></div>
- Настройка серверов и компьютеров, ноутбуков, планшетов<br/>
- Настройка сетей (оптоволокно, витая пара), IP-адресации<br/>
- Аналоговой и цифровой (IP) телефонии<br/>
- Настройка систем виртуализации<br/>
- Установка и настройка программного обеспечения<br/><br/>
Работы проводились в двух городах - Иркутск и Москва.<br/><br/>


<b>Группа компаний "Акустик Групп"</b> (<a href="https://www.acoustic.ru/">www.acoustic.ru</a>), г.Москва
<div style="margin-top:7px;">Компания занимается производством и продажей акустических решений.<br/>
Из знаковых проектов - Большой Театр, Московская Консерватория, отели Ibis, Mercure.</div>		

<ul class="spisok">
<li>Оборудование серверной комнаты - планирование, электропроводка, установка кондиционирования</li>
<li>Установка и настройка физических серверов Hewlett Packard (3шт), Depo Storm (Supermicro)</li>
<li>Установка и настройка серверных операционных систем Windows Server 2008/2012/2019 (10шт)</li>
<li>Настройка следующих высокотехнологичных систем:
	<ul class="vnutri">
		<li>ВЧС-сети, включающей 5 шлюзов на базе программного обеспечения Kerio Control</li>
		<li>Виртуальных серверов Microsoft Hyper-V и VMWare</li>
		<li>Настройка сервера Debian Linux c WEB-сервером, FTP-сервером<br/>
		<li>Настройка системы резервного копирования Windows Server Backup, Acronis</li>
		<li>Настройка системы резервного копирования Veeam Backup для виртуальных машин</li>
	</ul>
</li>
<li>Настройка и модернизация АТС Panasonic TDA-100, NSP/NCP 500, подключение линий IP и аналоговых от провайдера.</li>
<li>Реализация проекта по перепрораммированию имеющегося форума компании во внутрикорпоративный портал.<br/>Проект выполнен на языках HTML, CSS, Javascript, PHP, SQL.</li>
<li>Проведено несколько аудитов техники, сделаны заключения. Проведена модернизация парка техники.</li>
<li>Проведены аудиты программного обеспечения - сделаны заключения. Часть ПО лицензировано, в том числе ПО фирмы 1С, Microsoft, ESET</li>
<li>Произведён подбор и закупка печатного оборудования форматов A3/A4 цвет/чб фирм Ricoh, Brother, Canon</li>
</ul>

<b>Ваш Интернет Сервис</b> (<a href="http://1ps.ru">1ps.ru</a>), г.Иркутск

<ul class="spisok">
	<li>
		Установлен сервер на базе рабочей станции. 
		<br/>Роль - сервер каталога Active Directory.
		<br/>Операционная система Windows Server 2008 R2.
	</li>
	
	<li>
		Установлено два сервера Linux<br/>
		Роли - файловый сервер и шлюз в интернет, ВЧС-сервер.<br/>
		Операционная система Debian Linux.
	</li>
	<li>
		Установлен новый МФУ от HP
	</li>
	<li>
		Проведён аудит, обновлён парк офисной техники
	</li>
	<li>
		Введён в эксплуатацию дополнительный офис, проведена ЛВС, установлен коммутатор, компьютерные розетки.
	</li>
	<li>
		Приобретена аналоговая АТС Panasonic TES-824, выполнена донастройка и подключение телефонов
	</li>
	<li>
		Настроены системы резервного копирования Windows Server Backup и Acronis
	</li>
	<li>
		Настроена система прав доступа на папки
	</li>
	<li>
		Настроена централизованная система защиты от вирусов Kaspersky Antivirus & Kaspersky Security Center.
	</li>
	<li>
		Проанализирована и найдена уязвимость в коде сайта и передана разработчикам для устранения
	</li>
</ul>

<br/><br/>

<b>Компания "Инсайт"</b> (<a href="https://www.in-site.ru/">in-site.ru</a>), г.Иркутск
<ul class="spisok">
	<li>
		Выполнена вёрстка нескольких сайтов на языках HTML/CSS
	</li>
	<li>
		Выполнено программирование нескольких сайтов на языках PHP и JavaScript
	</li>
</ul>
 
<b>Иркутский лимнологический институт, Лаборатория геносистематики</b>, (<a href="http://www.lin.irk.ru/">www.lin.irk.ru</a>), г.Иркутск<div style="height:7px;"></div>
Программирование системы расчётов по моделям видообразования. Системное администрирование.<br/><br/>

<b>Медиалогия</b> (<a href="http://mlg.ru">mlg.ru</a>), г.Москва<div style="height:7px;"></div>

Системное администрирование сервиса по сбору новостей в интернет. Системы написаны на C#/Powershell. Также вносил правки в исходный код через Visual Studio и скрипты.<br/>
Выполнял deploy по средствам TFS, при этом поддерживал NLB - переключение клиентов между веб-серверами в процессе обновления. Отслеживал функционирование системы через Zabbix. 
Также столкнулся с обслуживанием Sphinx. <br/>Писал запросы на языке T-SQL. Системы Windows Server, MSSQL.
<br/><br/>


<b>ФГУП "Атлас"</b> (<a href="http://stcnet.ru/">stcnet.ru</a>), г.Иркутск<div style="height:7px;"></div>
Настройка и обслуживание комплексов учёта алкогольной продукции на базе компьютеров PC, баз данных MSSQL, средствами защиты. Консультирование клиентов в области использования услуг компании.

<b>Окей/Цезарь</b>, г.Иркутск<br/>
Прокладка ЛВС, настройка касс, торгового оборудования, принтеров, компьютерной техники.

<br/><br/>

<b>ADG Group</b> (<a href="https://www.adggroup.ru/">www.adggroup.ru</a>), г.Москва<div style="height:7px;"></div>
Экспертиза в разделе закупки оборудования и программного обеспечения, лицензирования ПО.<br/>
<br/>Проектирование устройства серверной инфраструктуры. Консультирование в области создания ИТ-бюджета компании с учётом специфики - определение стоимости нормомест и норм ПО.<br/>
<br/>Администрирование систем контроля доступа, серверной, в том числе виртуальной инфаструктуры. Управление почтовым сервером Exchange и телефонией Манго-Телеком.<br/>
<br/>Консультирование подрядчиков в разделе технического обеспечения и составление требований для открытия доп. офиса, установки систем видеонаблюдения.<br/>
<br/>Экспертиза в разделе выбора техники для организации мест труда для сотрудников.
<br/><br/>

<b>Softline</b> (<a href="http://softline.ru">softline.ru</a>), г.Иркутск<div style="height:7px;"></div>
Техническая экспертиза решений по программному обеспечению и серверному/инженерному оборудованию.<br/>
Помощь в презентации клиентам компании.
<br/><br/>

<b>Городская клиническая больница №6</b>, г.Иркутск<div style="height:7px;"></div>
Поддержка и настройка компьютеров и локальной сети. Экспертиза.
<br/><br/>

<b>Проект 24</b>, г.Москва<div style="height:7px;"></div>
Поддержка нескольких серверов, в т.ч. телефония PBX. Поддержка клиентских машин.<br/>
Windows Server, PBX (Asterix), Microsoft Windows 7, TeamViewer.
<br/><br/>



<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/podval.php"); ?>

