<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/verhushka.php"); ?>
<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/styli.php"); ?>
<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/shapka.php"); ?>

<h1>Наши проекты. <span style="color:#666;font-size:14pt;">Восстановление ВАЗ ОКА 11113 после угона</span>.</h1>

Итак, исходная ситация заключалась в следующем - был угнан ВАЗ ОКА 11113 2003 года выпуска.<br/>
Автомобиль был возвращён хозяину в день угона. Но были нанесены "увечья" автомобилю...<br/><br/>
Выбиты четыре из шести стёкол, сломано правое зеркало - <a href="#">о нём отдельно</a>.<br/><br/>
А также авто, собственно, не заводилось. Из других повреждений - погнут руль, сломан замок зажигания, оторваны панели обшивки руля.
<br/><br/>Плюс машина, ясно - забита стеклом. Да, задняя дверь богажника была погнута в результате попытки "войти в машину сзади", но это не удалось и поэтому начали бить стёкла.<br/><br/>
Вообщем-то, ситуация надо сказать "весёлая". Хозяин был жутко недоволен и расстроен случившимся...<br/><br/>
Но по иронии судьбы преступники были найдены и даже возмещён ущерб...<br/><br/>
И мы взялись за работу! Читайте, <a href="/projects/auto/oka-repair/step-by-step.php">что мы делали по шагам</a>, чтобы восстановить "ОКУШКУ".
<br/><br/>
А вот и она сама - фото до угона. Красотка...<br/><br/>
<img src="/kartinki/oka-oktyabr-2019.jpg"/>

<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/podval.php"); ?>

