<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/verhushka.php"); ?>
<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/styli.php"); ?>
<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/shapka.php"); ?>

<h1>Наши проекты. <span class="second_header">Восстановление ВАЗ ОКА 11113 после угона</span>.</h1>

<h2>Шаг за шагом...</h2>
История угона, и что нужно было восстановить <a href="/projects/auto/oka-repair/">здесь...</a><br/><br/>
Ока - машина, выпуск которой начался в 1987 году и до 2008 года было выпущено 700 тысяч экземпляров.<br/>
Тот экземпляр, которым занимались мы - жёлтого цвета, 2003 года выпуска, двигатель 0.7 литра.<br/><br/>
Сначала потребовалось выяснить, почему машина не заводится...<br/><br/>
Да, был сломан замок зажигания, но имелась фишка от замка - <a href="fishka-zamka.php">см. здесь</a>, как она выглядит и что из себя представляет.<br/><br/>
Точнее не замка зажигания, а выключателя зажигания. Вот, пожалуйста, <a href="">то, как выглядит новый</a> и <a href="#">история его покупки</a>...<br/><br/>
В результате было обнаружено, что фишка замка работает. И даже "клацает" стартер. Но он не крутит!<br/><br/>
И вот здесь мы уже <a href="">разбирались со стартером</a>.<br/><br/>
Пока разбирались со стартером - а в результате был приобретён новый - хозяину вернули деньги за причинённый ущерб.<br/><br/>
И тут уже вопрос встал о замене стёкол.<br/>
Конечно было неприятное ощущение, что если стёкла поставим, а завести так и не получится, то что?..
<br/>Но в результате последовательной работы над собой
и бесстрашия нашли, <a href="">где можно купить стёкла к Оке</a>.

<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/podval.php"); ?>

