<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/verhushka.php"); ?>
<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/styli.php"); ?>
<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/shapka.php"); ?>

<h1>
	Конструирование.
 </h1>

<h2>В моём детстве</h2>

Для меня эта тема началась относительно давно - в детстве, на даче. Тогда я наблюдал за разными приборами,
которыми занимался мой дед. То были сварочный аппарат, дрель, рубанок - много всего.<br/><br/>
Мне это нравилось и я тоже кое-что делал!<br/><br/>Например, собирал разные болты, гайки - скручивал их. Как-то даже сделал газонокосилку своими руками - деревянная рама,
листок ДВП снизу и нож, вращающийся на валу двигателя от стиральной машины. Руль от детского велосипеда трёхколёсного и от него же колёса. Косила машина за счёт электричества,
которое подавалось по проводу.<br/><br/>
А ещё мы с парнями ремонтировали и изменяли внешний вид своих велосипедов. Это было здорово!<br/> Был у нас такой буги-баги. Мы нашли раму от мопеда или мотоцикла.
Поставили на неё колёса от велосипеда и так вот катались, отталкиваясь ногами! Потом мой папа даже приварил нам сзади ось поперечную и "буги-баги" стал трёхколёсный.
Помню мы для взрослых сделали объявление и пытались его продать кому-нибудь. Это было замечательно!<br/><br/>
Помню ещё ребёнком около 4 лет я помогал маме на кухне и у неё сломалась чеснокодавка (выкрутился болт). Я взял похожий болт от железного конструктора (наверное, у многих
такие были) и починил. У меня даже не было идеи, сложно это или просто! Мне казалось это очевидным!<br/><br/>

<h2>Электрический ток</h2>

Потом в возрасте 5 лет (примерно) я возился с проводами, и решил собрать штекер для электрической сети. Я соединил два штырька вилки вместе и вставил в розетку! Меня тогда хорошо
тряхонуло, и я подумал, что меня бьёт мама, которая тогда была в коридоре, я же находился в комнате. Только позже мне объяснили, что это был электрический ток. И папа сказал - хорошо,
что он их соединил между собой!<br/><br/>
Недавно, когда я решил проверить работу обоих цилиндров на окушке, то сдёрнув высоковольтный провод я снова ощутил, что это такое - когда он прошёл через меня.
Сердце ещё некоторое время больно, а потом я его чувствовал некоторое время...

<div style="height:15px;"></div>
<h2>Опыт с машинами</h2>

Первая машина у меня появилась весной 2012 года. И это была Mazda Demio на литье, с люком, праворульная механика 1.3 литра серого цвета.
Пробыла она у меня недолго, около двух месяцев...<br/><br/>Потом ещё были Pagero IO, отцовская шестёрка, Mark II 1989 года выпуска ярко-синего цвета.<br/>
И пожалуй всё...<br/><br/>Первая машина, в которой я сам что-то ремонтировал был Марк II. Но тут появилась она - жёлтая окушка! И моя жизнь изменилась...

<div style="height:15px;"></div>
<h2>Ока</h2>

Жизнь складывается по-разному. У меня ОКА и я радуюсь ей. Это ВАЗ 11113 2003 года - досталась она мне в октябре 2019 года, пробег 30000 с копейками. Третий хозяин.<br/>
<br/>Всё говорило о том, что пробег реальный - ни гнили на кузове, в салоне аккуратно. Недавно моё предположение подтвердилось, когда я был в шиномонтажке - шины родные с завода.<br/>
<br/>
И вот передо мной встали интересные задачи - от замены замка зажигания. А его я переделал на кнопку и на данный момент электрика с замка снята, но оставил я его для замыкания руля.
Также завод сделал с кнопки. Потом менял стартер - по воле случая предыдущий был испорчен (не мной). Потом разбирался с поврёждённой электрикой. Снимал панель...<br/>
<br/>Всё это пришлось делать, после того, как мальчишки по 17 лет угоняли машину. Полиция их нашла, ущёрб возместили - а я вот занялся восстановлением.<br/>
<br/>Также сам вставлял стёкла (4 из 6и) - мне девушка моя помогала, технология конечно очень интересная...<br/><br/>
Родное правое зеркало (со стороны пассажира) не встаёт в заводской комплектации - это описывают в интернете, не знаю, у всех ли так, но у меня так было.<br/>
<br/>Купив комплект евро-зеркал я сильно удивился, потому что правое зеркало также не удалось отрегулировать - регулировка даже в крайнем положении показывает водителю область,
слишком далеко от машины, как будто сделано так, чтобы пассажир в это зеркало смотрел.<br/>
<br/>И когда мне разбили евро-зеркала угонщики, то я воспользовался случаем и
старые родные зеркала (впрочем, одно оказывается было не родное, похоже - у родных больше железных элементов), а именно правое - разобрал, снял фиксатор, который используется 
для складывания зеркала и жидкими гвоздями зафиксировал его в нужном положении. Нужно было, чтобы прошло три дня, чтобы жидкие гвозди хорошо затвердели - и наконец, зеркало встало, как надо.

<div style="height:15px;"></div>
<h2>Электические схемы ОКИ</h2>

Итак, как я сказал выше - я столкнулся с элетрикой в ОКЕ. Я поочёрёдно планирую разбирать здесь на своём сайте эти схемы по мере возможности. 
Я пробовал создавать схемы в Гугл-Таблицах. Пробовал их верстать. Но в итоге остановился на Inkscape - свободном векторном редакторе. Кое-что я делал в GIMP - тоже свободный, но растровый. <br/>
<br/>

<div style="height:5px;"></div>

<a href="/vaz-oka-11113/fary_i_povoroty/">Фары и поворотники</a> - подрулевые переключатели, фишка "мама", проводка, принцип работы
<div style="height:5px;"></div>
<a href="/projects/radio-electronica/detali/vaz11113-vykluchatel-avariynoi-signalizacii/">Аварийка</a> - выключатель,  фишка "мама", проводка, принцип работы
<div style="height:5px;"></div>
<a href="/vaz-oka-11113/perednij-stekloochistitel/">Передний стеклоочиститель</a> - подрулевые переключатели, фишка "мама", проводка, принцип работы

<?php include($_SERVER['DOCUMENT_ROOT'] . "/shablony/podval.php"); ?>